In [1]:
import pandas as pd
from pymongo import MongoClient
import json, requests
import os
from dotenv import load_dotenv
load_dotenv()
import requests
from pandas.io.json import json_normalize

In [2]:
'37.795531-122.400598'
def getapi(search):
    url = 'https://api.foursquare.com/v2/venues/explore'

    params = dict(
    client_id=os.getenv('Client_ID'),
    client_secret=os.getenv('Client_Sc'),
    v='20180323',
    ll='37.795531,-122.400598',
    query=search,
    limit=1
    )
    resp = requests.get(url=url, params=params)
    data = json.loads(resp.text)
    
    df_api = pd.DataFrame([{
        'query' : data['response']['query'],
        'total_results' : data['response']['totalResults'],
        'lat' : data['response']['suggestedBounds']['ne']['lat'],
        'lng' : data['response']['suggestedBounds']['ne']['lng']
        
        
    }])
    
    return df_api

In [3]:
df1 = getapi('School')
df1

    query  total_results        lat         lng
0  school            119  37.797885 -122.400901

In [4]:
df2 = getapi('Starbucks')
df2

       query  total_results        lat         lng
0  starbucks             52  37.795749 -122.397875

In [5]:
df3 = getapi('airport')
df3

     query  total_results        lat        lng
0  airport             63  37.618063 -122.38574

In [6]:
df4 = getapi('veganfood')
df4

       query  total_results        lat         lng
0  veganfood              1  37.759512 -122.425471

In [7]:
df5 = getapi('night club')
df5

        query  total_results        lat         lng
0  night club             24  37.790188 -122.405537

In [8]:
df6= getapi('starus ps')
df6

       query  total_results        lat         lng
0  starus ps             12  37.784942 -122.397313

In [9]:
result = pd.concat([df1, df2, df3,df4,df5,df6], ignore_index=True)
result

        query  total_results        lat         lng
0      school            119  37.797885 -122.400901
1   starbucks             52  37.795749 -122.397875
2     airport             63  37.618063 -122.385740
3   veganfood              1  37.759512 -122.425471
4  night club             24  37.790188 -122.405537
5   starus ps             12  37.784942 -122.397313

In [10]:
result.to_json("input/employee_needs.json",orient="records")